Revit 2027 API
AnalysisResultSchema(String, String) Constructor
 Creates object and assigns name and description
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisResultSchema(
	string name,
	string description
)
Public Sub New (
	name As String,
	description As String
)
public:
AnalysisResultSchema(
	String^ name,
	String^ description
)
new :
        name : string *
        description : string -> AnalysisResultSchema
Parameters
name String
 Name of the result schema
description String
 Description of the result schema
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisResultSchema Class
AnalysisResultSchema Overload
Autodesk.Revit.DB.Analysis Namespace